Revit 2027 API
PanelScheduleData.RemoveLoadClassification Method
 Remove a Load Classification Id from the array of Load Classifications
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveLoadClassification(
	int nIndex
)
Public Sub RemoveLoadClassification (
	nIndex As Integer
)
public:
void RemoveLoadClassification(
	int nIndex
)
member RemoveLoadClassification :
        nIndex : int -> unit
Parameters
nIndex Int32
 The index at which to remove the load classification
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace